In [1]:
a=10
b=20
c=a+b
print(c)

30

**step-1: import packages**

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
import pandas as pd           #data analysis 
import numpy as np            #numbers or mathematical data
import matplotlib.pyplot as plt   # graphs
import seaborn as sns         # visuialization

**step-2:create a Df using list**

In [2]:
names=['ramesh','suresh','satish']
#pd.DataFrame(data,index,columns)
pd.DataFrame(names)

        0
0  ramesh
1  suresh
2  satish

**step-3:I want to change the Index**

In [4]:
names=['rames','suresh','satish']
ids=['1','2','3']
pd.DataFrame(names,ids)

        0
1   rames
2  suresh
3  satish

**step-4: i want to add the columns**

In [6]:
names=['ramesh','suresh','satish']
ids=['1','2','3']
cols=['NAMES']
pd.DataFrame(names,ids,cols)

    NAMES
1  ramesh
2  suresh
3  satish

**step-5: data and coloumns only**

In [7]:
names=['ramesh','suresh','satish']
cols=['NAMES']
pd.DataFrame(names,columns=cols)

    NAMES
0  ramesh
1  suresh
2  satish

In [8]:
ids=['1','2','3']
cols=['NAMES']
pd.DataFrame(index=ids,columns=cols)

  NAMES
1   NaN
2   NaN
3   NaN

**step-6: multiple coloumns**

In [7]:
names=['ramesh','suresh','satish']
age=['20','22','24']
cols=['Names','Age']
df=pd.DataFrame(zip(names,age)
             ,columns=cols)

df

    Names Age
0  ramesh  20
1  suresh  22
2  satish  24

**step-7: add a new column to already existed dataframe**

- in above first we have taken data

- then created a dataframe

- now e want to add new data based on requirement

In [16]:
city=['Hyd','Pune','Bnglr']
df['City']=city
df

    Names Age   City
0  ramesh  20    Hyd
1  suresh  22   Pune
2  satish  24  Bnglr

In [17]:
city=['Hyd','Pune','Bnglr']
df['Country']=city
df

    Names Age   City Country
0  ramesh  20    Hyd     Hyd
1  suresh  22   Pune    Pune
2  satish  24  Bnglr   Bnglr

In [26]:
Marks=['10','20','30']
df['Marks']=Marks
df

    Names Age   City Country marks Marks
0  ramesh  20    Hyd     Hyd    10    10
1  suresh  22   Pune    Pune    20    20
2  satish  24  Bnglr   Bnglr    30    30

**step-8: update the colum with new values**

In [27]:
df['Marks']=[200,300,400]

In [28]:
df

    Names Age   City Country marks  Marks
0  ramesh  20    Hyd     Hyd    10    200
1  suresh  22   Pune    Pune    20    300
2  satish  24  Bnglr   Bnglr    30    400

**step-9: create empty data frames and add the columns**

In [31]:
df=pd.DataFrame()
df['Names']=['ramesh','suresh','satish']
df['Age']=[20,22,24]
df['City']=['Hyd','Pune','Bnglr']
df

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

**step-10: create a dataframe using dictionary**

In [9]:
d={'Names':['ramesh','suresh','satish'],
    'Age':[20,22,24],
    'City':['Hyd','Pune','Bnglr']}
df=pd.DataFrame(d)
df

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [10]:
d={'Names':'ramesh',
    'Age':20,
    'City':'Hyd'}
df=pd.DataFrame(d)
df

ValueError: If using all scalar values, you must pass an index

In [38]:
d={'Names':'ramesh',
    'Age':20,
    'City':'Hyd'}
pd.DataFrame(d,index=[0])

    Names  Age City
0  ramesh   20  Hyd

**step-11: saving the dataframe**

In [39]:
df.to_csv('data.csv')

In [41]:
df.to_excel('data.xlsx')

**step-12: how to read the dataframe**

In [11]:
# in oreder to read the data
# filename.txt
# open(mbox-short.txt).read()
# open(dummy.txt,mode='w').write('hello')

In [12]:
pd.read_csv('data.csv')

   Unnamed: 0   Names  Age City
0           0  ramesh   20  Hyd

In [13]:
df

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [14]:
d={'Names':['ramesh','suresh','satish'],
    'Age':[20,22,24],
    'City':['Hyd','Pune','Bnglr']}
df=pd.DataFrame(d)
df

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [15]:
df.to_csv('data1.csv',index=False)

In [16]:
pd.read_csv('data1.csv')

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [18]:
df.to_excel('data1.xlsx',index=False)

In [19]:
pd.read_excel('data1.xlsx')

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [20]:
Marks=['10','20','30']
df['Marks']=Marks
df

    Names  Age   City Marks
0  ramesh   20    Hyd    10
1  suresh   22   Pune    20
2  satish   24  Bnglr    30

**step-13: drop the coloum**

In [22]:
df.drop(index=1)

    Names  Age   City Marks
0  ramesh   20    Hyd    10
2  satish   24  Bnglr    30

In [23]:
df.drop(index=2)

    Names  Age  City Marks
0  ramesh   20   Hyd    10
1  suresh   22  Pune    20

In [24]:
df

    Names  Age   City Marks
0  ramesh   20    Hyd    10
1  suresh   22   Pune    20
2  satish   24  Bnglr    30

In [27]:
df.drop(columns='Marks')

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [28]:
df.drop(columns='Age')

    Names   City Marks
0  ramesh    Hyd    10
1  suresh   Pune    20
2  satish  Bnglr    30

In [30]:
df.drop(columns=['Marks','Age'])

    Names   City
0  ramesh    Hyd
1  suresh   Pune
2  satish  Bnglr

In [31]:
df

    Names  Age   City Marks
0  ramesh   20    Hyd    10
1  suresh   22   Pune    20
2  satish   24  Bnglr    30

In [ ]:
df.drop(index=1)
df.drop(columns='Marks')
########################################
df.drop(1)       # 1 become label
df.drop('Marks')  # if i dont give argument label 
###################################################
# we need to provide axis
# axis=0 indicates index
# axis=1 indicates columns

In [35]:
df.drop('Marks',axis=1)

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [36]:
df.drop('Marks',axis=0)

KeyError: "['Marks'] not found in axis"

**inplace**

- when w edo the operation the result output is not overwriting

- means the original dataframe is asame as it is

- in order to do this we need to use **inplace**

- by default inplace=False

- make **inplace=True** if you want to write the result

In [38]:
df.drop('Marks',axis=1,inplace=True)

In [39]:
df

    Names  Age   City
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

**step-14: Rename the column**

In [45]:
d={'City':'city'}    #{old:new}
df.rename(d,axis=0,inplace=True)

In [46]:
df

    Names  Age   city
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [48]:
d={'City':'Place'}
df.rename(d,axis=0,inplace=True)
df

    Names  Age   city
0  ramesh   20    Hyd
1  suresh   22   Pune
2  satish   24  Bnglr

In [49]:
# Create one more df
# x= 1 to 10
# y= square x
# z= cube x

x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df=pd.DataFrame(zip(x,y,z),
               columns=['X','Y','Z'])
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

- len

- shape 

- size  

- head

- tail

- isnull

- info

- dtypes

In [62]:
len(df)

10

In [51]:
df.shape

(10, 3)

In [52]:
df.size

30

In [61]:
df.head()
#df.head(n: 'int' = 5) -> 'Self'

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [55]:
df.tail()

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [56]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [63]:
df.isnull().sum()

X    0
Y    0
Z    0
dtype: int64

In [64]:
df.dtypes
# if any categorical colums occurs
# if string is there it represents as object

X    int64
Y    int64
Z    int64
dtype: object

In [60]:
df.info()

#df.info(
#    verbose: 'bool | None' = None,
#    buf: 'WriteBuffer[str] | None' = None,
#    max_cols: 'int | None' = None,
#    memory_usage: 'bool | str | None' = None,
#    show_counts: 'bool | None' = None,
#) -> 'None'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

**step-15: select a columns**

In [65]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [67]:
df['X']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [69]:
df[['X','Y']]

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [70]:
type(df['X'])
#1D

pandas.core.series.Series

In [71]:
type(df[['X','Y']])
#2D

pandas.core.frame.DataFrame

In [72]:
df['X'].shape

(10,)

In [73]:
df[['X','Y']].shape

(10, 2)

In [76]:
df                        # entire dataframe
df['Z']                   # selecting the particular column
df['Z'].values            # extracting the data
df['Z'].values.tolist()   # list

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [75]:
df[['Y','Z']].values

array([[   1,    1],
       [   4,    8],
       [   9,   27],
       [  16,   64],
       [  25,  125],
       [  36,  216],
       [  49,  343],
       [  64,  512],
       [  81,  729],
       [ 100, 1000]])

In [77]:
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [78]:
df['Z']

0       1
1       8
2      27
3      64
4     125
5     216
6     343
7     512
8     729
9    1000
Name: Z, dtype: int64

In [79]:
df['Z'].values

array([   1,    8,   27,   64,  125,  216,  343,  512,  729, 1000])

In [80]:
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]